Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ1064DAL176.PIC
      <edc:SFRDef edc:_addr="0x1F880040" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="----------rrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1TREC" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1TREC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RERRCNT" edc:desc="" edc:mask="0xff" edc:name="RERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="TERRCNT" edc:desc="" edc:mask="0xff" edc:name="TERRCNT" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F880050" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1FSTAT" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FSTAT" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FIFOIP" edc:desc="" edc:mask="0xffffffff" edc:name="FIFOIP" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="FIFOIP0" edc:desc="" edc:mask="0x1" edc:name="FIFOIP0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP1" edc:desc="" edc:mask="0x1" edc:name="FIFOIP1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP2" edc:desc="" edc:mask="0x1" edc:name="FIFOIP2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP3" edc:desc="" edc:mask="0x1" edc:name="FIFOIP3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP4" edc:desc="" edc:mask="0x1" edc:name="FIFOIP4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP5" edc:desc="" edc:mask="0x1" edc:name="FIFOIP5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP6" edc:desc="" edc:mask="0x1" edc:name="FIFOIP6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP7" edc:desc="" edc:mask="0x1" edc:name="FIFOIP7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP8" edc:desc="" edc:mask="0x1" edc:name="FIFOIP8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP9" edc:desc="" edc:mask="0x1" edc:name="FIFOIP9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP10" edc:desc="" edc:mask="0x1" edc:name="FIFOIP10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP11" edc:desc="" edc:mask="0x1" edc:name="FIFOIP11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP12" edc:desc="" edc:mask="0x1" edc:name="FIFOIP12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP13" edc:desc="" edc:mask="0x1" edc:name="FIFOIP13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP14" edc:desc="" edc:mask="0x1" edc:name="FIFOIP14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP15" edc:desc="" edc:mask="0x1" edc:name="FIFOIP15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP16" edc:desc="" edc:mask="0x1" edc:name="FIFOIP16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP17" edc:desc="" edc:mask="0x1" edc:name="FIFOIP17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP18" edc:desc="" edc:mask="0x1" edc:name="FIFOIP18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP19" edc:desc="" edc:mask="0x1" edc:name="FIFOIP19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP20" edc:desc="" edc:mask="0x1" edc:name="FIFOIP20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP21" edc:desc="" edc:mask="0x1" edc:name="FIFOIP21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP22" edc:desc="" edc:mask="0x1" edc:name="FIFOIP22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP23" edc:desc="" edc:mask="0x1" edc:name="FIFOIP23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP24" edc:desc="" edc:mask="0x1" edc:name="FIFOIP24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP25" edc:desc="" edc:mask="0x1" edc:name="FIFOIP25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP26" edc:desc="" edc:mask="0x1" edc:name="FIFOIP26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP27" edc:desc="" edc:mask="0x1" edc:name="FIFOIP27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP28" edc:desc="" edc:mask="0x1" edc:name="FIFOIP28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP29" edc:desc="" edc:mask="0x1" edc:name="FIFOIP29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP30" edc:desc="" edc:mask="0x1" edc:name="FIFOIP30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FIFOIP31" edc:desc="" edc:mask="0x1" edc:name="FIFOIP31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F880060" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="C1RXOVF" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXOVF" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXOVF" edc:desc="" edc:mask="0xffffffff" edc:name="RXOVF" edc:nzwidth="0x20"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="RXOVF0" edc:desc="" edc:mask="0x1" edc:name="RXOVF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF1" edc:desc="" edc:mask="0x1" edc:name="RXOVF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF2" edc:desc="" edc:mask="0x1" edc:name="RXOVF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF3" edc:desc="" edc:mask="0x1" edc:name="RXOVF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF4" edc:desc="" edc:mask="0x1" edc:name="RXOVF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF5" edc:desc="" edc:mask="0x1" edc:name="RXOVF5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF6" edc:desc="" edc:mask="0x1" edc:name="RXOVF6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF7" edc:desc="" edc:mask="0x1" edc:name="RXOVF7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF8" edc:desc="" edc:mask="0x1" edc:name="RXOVF8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF9" edc:desc="" edc:mask="0x1" edc:name="RXOVF9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF10" edc:desc="" edc:mask="0x1" edc:name="RXOVF10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF11" edc:desc="" edc:mask="0x1" edc:name="RXOVF11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF12" edc:desc="" edc:mask="0x1" edc:name="RXOVF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF13" edc:desc="" edc:mask="0x1" edc:name="RXOVF13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF14" edc:desc="" edc:mask="0x1" edc:name="RXOVF14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF15" edc:desc="" edc:mask="0x1" edc:name="RXOVF15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF16" edc:desc="" edc:mask="0x1" edc:name="RXOVF16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF17" edc:desc="" edc:mask="0x1" edc:name="RXOVF17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF18" edc:desc="" edc:mask="0x1" edc:name="RXOVF18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF19" edc:desc="" edc:mask="0x1" edc:name="RXOVF19" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF20" edc:desc="" edc:mask="0x1" edc:name="RXOVF20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF21" edc:desc="" edc:mask="0x1" edc:name="RXOVF21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF22" edc:desc="" edc:mask="0x1" edc:name="RXOVF22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF23" edc:desc="" edc:mask="0x1" edc:name="RXOVF23" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF24" edc:desc="" edc:mask="0x1" edc:name="RXOVF24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF25" edc:desc="" edc:mask="0x1" edc:name="RXOVF25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF26" edc:desc="" edc:mask="0x1" edc:name="RXOVF26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF27" edc:desc="" edc:mask="0x1" edc:name="RXOVF27" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF28" edc:desc="" edc:mask="0x1" edc:name="RXOVF28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF29" edc:desc="" edc:mask="0x1" edc:name="RXOVF29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF30" edc:desc="" edc:mask="0x1" edc:name="RXOVF30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXOVF31" edc:desc="" edc:mask="0x1" edc:name="RXOVF31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
